In [79]:
# Installing pandas.

import sys
!{sys.executable} -m pip install pandas

Requirement already satisfied: pandas in /opt/homebrew/Cellar/jupyterlab/4.5.1/libexec/lib/python3.14/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in /opt/homebrew/lib/python3.14/site-packages (from pandas) (2.4.0)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/homebrew/Cellar/jupyterlab/4.5.1/libexec/lib/python3.14/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/homebrew/Cellar/jupyterlab/4.5.1/libexec/lib/python3.14/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /opt/homebrew/Cellar/jupyterlab/4.5.1/libexec/lib/python3.14/site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in /opt/homebrew/Cellar/jupyterlab/4.5.1/libexec/lib/python3.14/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [80]:
import numpy as np
import pandas as pd

In [81]:
# Create a Pandas Series from a list.

a = pd.Series([1, 2, 3, 4, 5])
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [82]:
# Create a Series with a custom index.

marks = [98, 90, 97, 100, 95]
subjects= ['Science', 'Math', 'Hindi', 'English', 'Computer Science']

marks_series = pd.Series(marks, index = subjects)

marks_series

Science              98
Math                 90
Hindi                97
English             100
Computer Science     95
dtype: int64

In [83]:
# Create a DataFrame from:

# Dictionary of lists
a1 = {
    "name": ['Ananya', 'Aditi', 'Shreyansh'],
    "age": [23, 21, 14],
    "gender": ['female', 'female', 'male']
}

info_df = pd.DataFrame(a1)

info_df

# NumPy array
b = np.arange(12).reshape(4, 3)
b_df = pd.DataFrame(b)

b_df

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [84]:
# Display head(), tail(), info(), describe().

print(info_df.head(2))
print(info_df.tail(2))

print(b_df.info())
print(b_df.describe())
print(info_df.describe())

     name  age  gender
0  Ananya   23  female
1   Aditi   21  female
        name  age  gender
1      Aditi   21  female
2  Shreyansh   14    male
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      int64
 1   1       4 non-null      int64
 2   2       4 non-null      int64
dtypes: int64(3)
memory usage: 228.0 bytes
None
              0          1          2
count  4.000000   4.000000   4.000000
mean   4.500000   5.500000   6.500000
std    3.872983   3.872983   3.872983
min    0.000000   1.000000   2.000000
25%    2.250000   3.250000   4.250000
50%    4.500000   5.500000   6.500000
75%    6.750000   7.750000   8.750000
max    9.000000  10.000000  11.000000
             age
count   3.000000
mean   19.333333
std     4.725816
min    14.000000
25%    17.500000
50%    21.000000
75%    22.000000
max    23.000000

In [85]:
info_df

        name  age  gender
0     Ananya   23  female
1      Aditi   21  female
2  Shreyansh   14    male

In [86]:
#Access: Single column, Multiple columns

info_df['name']
info_df[['name', 'gender']]

        name  gender
0     Ananya  female
1      Aditi  female
2  Shreyansh    male

In [87]:
# Access rows using loc and iloc.

b_df.iloc[0:2]

marks = [98, 90, 97, 100, 95]
subjects= ['Science', 'Math', 'Hindi', 'English', 'Computer Science']

marks_df = pd.DataFrame(marks, index = subjects)

marks_df.loc[['Science', 'Hindi']]

          0
Science  98
Hindi    97

In [88]:
info_df

        name  age  gender
0     Ananya   23  female
1      Aditi   21  female
2  Shreyansh   14    male

In [89]:
# Rename columns.

info_df.rename(columns = {
    "name" : "Name",
    "age" : "Age",
    "gender" : "Gender"
}
    )

        Name  Age  Gender
0     Ananya   23  female
1      Aditi   21  female
2  Shreyansh   14    male

In [90]:
info_df.dtypes

name      object
age        int64
gender    object
dtype: object

In [91]:
#Change column data types.
    
info_df['age'].astype(int)
info_df.astype({
    "age": int,
    "gender": "string"
})

        name  age  gender
0     Ananya   23  female
1      Aditi   21  female
2  Shreyansh   14    male

In [92]:
# Set and reset index.

print(info_df.set_index("age", drop = False))
info_df.reset_index()

          name  age  gender
age
23      Ananya   23  female
21       Aditi   21  female
14   Shreyansh   14    male

   index       name  age  gender
0      0     Ananya   23  female
1      1      Aditi   21  female
2      2  Shreyansh   14    male

In [93]:
# Sort DataFrame.

print(info_df.sort_values(by = "name", ascending = False))

        name  age  gender
2  Shreyansh   14    male
0     Ananya   23  female
1      Aditi   21  female